# SF Salaries Exercise 

## **A. J. Zerouali (2021/07/08)**

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

## Question 00:

In [1]:
import numpy as np
import pandas as pd

________________________

## Question 01:

**Read Salaries.csv as a dataframe called sal.**

In [2]:
# SF stands for San Francisco not Special Forces... 
df_sf_salaries = pd.read_csv("Salaries.csv")
# Checking the head just returns the first n rows
df_sf_salaries.head(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.00,8601.00,189082.74,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.90,134426.14,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.00,51322.50,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.00,0.00,17115.73,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN

**Comment:** There's also a useful method to look at the "tail" of a data frame:

In [3]:
df_sf_salaries.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

## Question 02:

**Check the head of the DataFrame:**

#### Answer

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

________________________

## Question 03:

**Use the .info() method to find out how many entries there are.**

In [7]:
# There are 148654 rows (names) and 13 columns in this data frame
df_sf_salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

#### Answer

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

________________________

## Question 04:

**What is the average BasePay ?**

In [12]:
df_sf_salaries['BasePay'].mean()

66325.44884050643

**Remark:** Remember that pd_dataframe['Label'] will return the column. For the row you use pd_dataframe.iloc['Row index']:

In [13]:
df_sf_salaries.iloc[1]

Id                                                2
EmployeeName                           GARY JIMENEZ
JobTitle            CAPTAIN III (POLICE DEPARTMENT)
BasePay                                   155966.02
OvertimePay                               245131.88
OtherPay                                  137811.38
Benefits                                        NaN
TotalPay                                  538909.28
TotalPayBenefits                          538909.28
Year                                           2011
Notes                                           NaN
Agency                                San Francisco
Status                                          NaN
Name: 1, dtype: object

#### Answer

66325.44884050643

________________________

## Question 05:

**What is the highest amount of OvertimePay in the dataset ?**

In [17]:
# This is in the "OvertimePay" column
df_sf_salaries['OvertimePay'].max()

245131.88

#### Answer

245131.88

* Who has the highest overtime pay?

In [19]:
# Firstly, .argmax() will find the INDEX
df_sf_salaries['OvertimePay'].argmax()

1

In [21]:
# Secondly, here's a compact way to get the corresponding series:
df_sf_salaries.loc[df_sf_salaries['OvertimePay'].argmax()]

Id                                                2
EmployeeName                           GARY JIMENEZ
JobTitle            CAPTAIN III (POLICE DEPARTMENT)
BasePay                                   155966.02
OvertimePay                               245131.88
OtherPay                                  137811.38
Benefits                                        NaN
TotalPay                                  538909.28
TotalPayBenefits                          538909.28
Year                                           2011
Notes                                           NaN
Agency                                San Francisco
Status                                          NaN
Name: 1, dtype: object

**Remark:** The lectures did not really cover how to extract the indices. Kind of frustrating and fun at the same time.

________________________

## Question 06:

**What is the job title of  JOSEPH DRISCOLL ?** 

Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll).

This one requires some thinking. I'll try with conditional selection

In [26]:
df_sf_salaries.loc[df_sf_salaries['EmployeeName']=='JOSEPH DRISCOLL']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

In [28]:
type(df_sf_salaries.loc[df_sf_salaries['EmployeeName']=='JOSEPH DRISCOLL'])

pandas.core.frame.DataFrame

Passing a Boolean as an argument in .loc() gives the corresponding data frame. Thus, the job title of J. Driscoll is:

In [29]:
df_sf_salaries.loc[df_sf_salaries['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

#### Answer

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

## Question 07:

**How much does JOSEPH DRISCOLL make (including benefits)?**

How the hell is that any of our business. Poor Driscoll...

In [30]:
df_sf_salaries.loc[df_sf_salaries['EmployeeName']=='JOSEPH DRISCOLL'].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1 entries, 24 to 24
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                1 non-null      int64
 1   EmployeeName      1 non-null      object
 2   JobTitle          1 non-null      object
 3   BasePay           1 non-null      float64
 4   OvertimePay       1 non-null      float64
 5   OtherPay          1 non-null      float64
 6   Benefits          0 non-null      float64
 7   TotalPay          1 non-null      float64
 8   TotalPayBenefits  1 non-null      float64
 9   Year              1 non-null      int64
 10  Notes             0 non-null      float64
 11  Agency            1 non-null      object
 12  Status            0 non-null      float64
dtypes: float64(8), int64(2), object(3)
memory usage: 112.0+ bytes

In [31]:
df_sf_salaries.loc[df_sf_salaries['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

#### Answer:

24    270324.91
Name: TotalPayBenefits, dtype: float64

________________________

## Question 08:

**What is the name of highest paid person (including benefits)?**

**Without** conditional selection:

In [34]:
# Test
df_sf_salaries.loc[df_sf_salaries['TotalPayBenefits'].argmax()]

Id                                                               1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                  167411.18
OvertimePay                                                    0.0
OtherPay                                                 400184.25
Benefits                                                       NaN
TotalPay                                                 567595.43
TotalPayBenefits                                         567595.43
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
Name: 0, dtype: object

In [35]:
df_sf_salaries.loc[df_sf_salaries['TotalPayBenefits'].argmax()]['EmployeeName']

'NATHANIEL FORD'

**With** conditional selection:

In [36]:
df_sf_salaries.loc[df_sf_salaries['TotalPayBenefits']==df_sf_salaries['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

... and if we extract the name only:

In [37]:
df_sf_salaries.loc[df_sf_salaries['TotalPayBenefits']==df_sf_salaries['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

#### Answer

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

## Question 09:

**What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

La honte...

Why is the lowest paid dude a latino and the highest paid one white?

In [38]:
df_sf_salaries.loc[df_sf_salaries['TotalPayBenefits']==df_sf_salaries['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

#### Answer

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

________________________

## Question 10:

**What was the average (mean) BasePay of all employees per year? (2011-2014) ?**

First, how many unique values do we have for the years?

In [39]:
df_sf_salaries['Year'].value_counts()

2014    38123
2013    37606
2012    36766
2011    36159
Name: Year, dtype: int64

**A - Pivot table solution**
This looks like something that should be done with pivot tables. Recall the prototype:

df_pivtb.pivot_table(values='D',index=['A', 'B'],columns=['C'])

When aggrgating with .pivot_table(), Pandas automatically returns the average of the entries. To pick another function, use the argument **aggfunc** with name of function.

In [46]:
df_sf_salaries.pivot_table(values = 'BasePay', index = 'Year')

           BasePay
Year
2011  63595.956517
2012  65436.406857
2013  69630.030216
2014  66564.421924

**B - Groupby solution**

An easier way to do this is to use groupby. Recall the prototype:

df.groupby('Label').mean()

df.groupby('Label') will create a DataFrameGrouBy object, and Pandas expects one to apply some function to it. After applying the method one gets a data frame.

In [3]:
df_avg_salaries_year = df_sf_salaries.groupby('Year').mean()

In [5]:
df_avg_salaries_year['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

#### Answer

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

________________________

## Question 11:

**How many unique job titles are there?**

Direct application of .nunique().

In [47]:
df_sf_salaries['JobTitle'].nunique()

2159

#### Answer

2159

## Question 12:

**What are the top 5 most common jobs?**

This is more involved, but it's a .value_counts() question on df_sf_salaries['JobTitle']. This method will automatically sort by number of instances for each job title.

In [26]:
df_valcnt_jobttl = df_sf_salaries['JobTitle'].value_counts()

In [32]:
df_valcnt_jobttl.iloc[0:5]

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

**Remark:** Looks like the 5 is inclusive in df_valcnt_jobttl.iloc[0:5], this isn't the usual indexing of Python.

#### Answer

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

________________________

## Question 13:

**How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)**

I answered this in 3 different ways. First, I reduce the data frame to 2013 jobs (*df_sf_2013*), then I use .value_counts() to extract a series whose labels are the job titles and the values are the number of employees with said titles (*ser_job_valcnts_2013*). Now to count how many labels have only one employee:

1) We could use a for loop on *ser_job_valcnts_2013* to find how many labels have entry 1. Brute force stupid.

2) Convert *ser_job_valcnts_2013* to a data frame and use boolean selection 'JobTitle' label, which now returns the number of occurences of each job title.

3) Use .value_counts() again on *ser_job_valcnts_2013*, which now returns how many job titles there are for each entry (confusing but works).

A) I'll start by restricting my attention to 2013 entries.

In [3]:
df_sf_2013 = df_sf_salaries[(df_sf_salaries['Year']==2013)]

In [4]:
df_sf_2013.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 37606 entries, 72925 to 110530
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                37606 non-null  int64
 1   EmployeeName      37606 non-null  object
 2   JobTitle          37606 non-null  object
 3   BasePay           37001 non-null  float64
 4   OvertimePay       37606 non-null  float64
 5   OtherPay          37606 non-null  float64
 6   Benefits          37606 non-null  float64
 7   TotalPay          37606 non-null  float64
 8   TotalPayBenefits  37606 non-null  float64
 9   Year              37606 non-null  int64
 10  Notes             0 non-null      float64
 11  Agency            37606 non-null  object
 12  Status            0 non-null      float64
dtypes: float64(8), int64(2), object(3)
memory usage: 4.0+ MB

B) Make a new series from the value counts in df_sf_2013['JobTitle'].

In [5]:
ser_job_valcnts_2013 = df_sf_2013['JobTitle'].value_counts()

Now the job titles are the labels.

In [6]:
ser_job_valcnts_2013.head()

Transit Operator                2295
Special Nurse                   1445
Registered Nurse                1231
Public Svc Aide-Public Works     859
Custodian                        789
Name: JobTitle, dtype: int64

In [7]:
# We get 1051 job titles
ser_job_valcnts_2013.shape

(1051,)

Here's the smartest solution: **use a value count again**.

In [14]:
ser_job_valcnts_2013.value_counts()

1       202
2        69
3        65
4        58
5        51
       ...
135       1
134       1
125       1
123       1
1445      1
Name: JobTitle, Length: 152, dtype: int64

**Data frame solution**

C) Convert the previous series into a data frame.

In [16]:
df_job_valcnts = pd.DataFrame(ser_job_valcnts_2013)
df_job_valcnts.columns

Index(['JobTitle'], dtype='object')

In [17]:
df_job_valcnts.head()

                              JobTitle
Transit Operator                  2295
Special Nurse                     1445
Registered Nurse                  1231
Public Svc Aide-Public Works       859
Custodian                          789

In [18]:
len(df_job_valcnts[df_job_valcnts['JobTitle']==1])

202

In [19]:
df_job_valcnts[df_job_valcnts['JobTitle']==1].count

<bound method DataFrame.count of                                 JobTitle
Special Assistant 15                   1
Traffic Sign Manager                   1
Track Maint Supt, Muni Railway         1
Assistant Director, Probate            1
Arborist Technician Supv II            1
...                                  ...
Soft Floor Coverer Supvr I             1
Plumber Supervisor 2                   1
Assistant Inspector                    1
Ornamental Iron Wrk Sprv 1             1
Environmental Hlth Tech 2              1

[202 rows x 1 columns]>

**Brute force solution:**

In [43]:
n_unique_rep = 0
for i in range(len(ser_job_valcnts_2013)):
    if ser_job_valcnts_2013[i] ==1:
        n_unique_rep += 1

In [44]:
n_unique_rep

202

#### Answer

202

________________________

Would be useful to use a Boolean here too:

In [60]:
tmp_str = "Chief executive officer"
print("Chief" in tmp_str)

True

In [20]:
df_sf_salaries.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

## Question 14:

**How many people have the word Chief in their job title? (This is pretty tricky)**

**Comments: (21/07/14)** I learned a lot from this question actually.

- There are several statements used for Booleans that are not overloaded to Pandas series/data frames, so one needs to be careful. Here, the "in" statement does not work.

- One should always check the consistency of the data. The "Chief" title here appears in 3 different guises: "Chief", "chief", and "CHIEF". Not taking this into account led both me and Portilla to give incorrect answers.

- **Use the .apply() method.** There's a reason why Microsoft allow Excel users to implement macros, and similarly, one of the fundamental strengths of Pandas is the possibility of passing a function as an argument to cycle through entire series. More importantly, the .apply() method is specifically designed to **avoid adding loops**.

* The obvious answer is to look at df_sf_salaries[("Chief" in df_sf_salaries['JobTitle'])]:

In [22]:
df_chiefs_temp = df_sf_salaries["CHIEF" in df_sf_salaries['JobTitle']]

KeyError: False

That doesn't work, most probably because "in" hasn't been overloaded to Pandas series.

* Here we extract the job titles series

In [23]:
ser_jobtitles = df_sf_salaries['JobTitle']

In [24]:
type(ser_jobtitles)

pandas.core.series.Series

In [25]:
ser_jobtitles.head()

0    GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                   CAPTAIN III (POLICE DEPARTMENT)
2                   CAPTAIN III (POLICE DEPARTMENT)
3              WIRE ROPE CABLE MAINTENANCE MECHANIC
4      DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
Name: JobTitle, dtype: object

In [27]:
type(ser_jobtitles[0])

str

In [28]:
len(ser_jobtitles)

148654

In [32]:
ser_jobtitles.str()

**About mistakes:**

* First, I made a mistake and got only 204 job titles:

In [36]:
n_chiefs = 0
for i in range(len(ser_jobtitles)):
    if ("CHIEF" in ser_jobtitles[i]):
        n_chiefs += 1
print(f"Get that: n_chiefs = {n_chiefs}")

Get that: n_chiefs = 204

Because I **didn't check my dataset for consistency**.

* Indeed, the word "chief" appears with several capitalizations: *CHIEF*, *Chief* and *chief*. Using this, we get 627 job titles containing chief:

In [35]:
n_chiefs = 0
for i in range(len(ser_jobtitles)):
    if ("CHIEF" in ser_jobtitles[i]) or ("Chief" in ser_jobtitles[i]) or ("chief" in ser_jobtitles[i]):
        n_chiefs += 1
print(f"Get that: n_chiefs = {n_chiefs}")

Get that: n_chiefs = 627

* Using a loop as above is a **wrong** answer too. The correct way to proceed is to make a function that checks if the job title contains a variation of "Chief", and then use that function for Boolean selection.

In [7]:
def check_chief(in_str):
    if ("CHIEF" in in_str) or ("Chief" in in_str) or ("chief" in in_str):
        return True
    else:
        return False

In [8]:
df_chiefs_temp = df_sf_salaries[df_sf_salaries['JobTitle'].apply(check_chief)]

In [9]:
len(df_chiefs_temp)

627

* Let's try this with a lambda expression instead of an additional function. We get a one line solution:

In [14]:
len(df_sf_salaries[df_sf_salaries['JobTitle'].apply(lambda x: ('chief' in x.lower()))])

627

#### Answer

477

________________________

## Question 15:

**Bonus: Is there a correlation between length of the Job Title string and Salary?**

The answer given by Pierian Data for this question looks like a correlation coefficients matrix. **Checked the solutions: They indeed use .corr() after adding a title length to df_sf_salaries.**

In [34]:
help(np.corrcoef)

Help on function corrcoef in module numpy:

corrcoef(x, y=None, rowvar=True, bias=<no value>, ddof=<no value>)
    Return Pearson product-moment correlation coefficients.

    Please refer to the documentation for `cov` for more detail.  The
    relationship between the correlation coefficient matrix, `R`, and the
    covariance matrix, `C`, is

    .. math:: R_{ij} = \frac{ C_{ij} } { \sqrt{ C_{ii} * C_{jj} } }

    The values of `R` are between -1 and 1, inclusive.

    Parameters
    ----------
    x : array_like
        A 1-D or 2-D array containing multiple variables and observations.
        Each row of `x` represents a variable, and each column a single
        observation of all those variables. Also see `rowvar` below.
    y : array_like, optional
        An additional set of variables and observations. `y` has the same
        shape as `x`.
    rowvar : bool, optional
        If `rowvar` is True (default), then each row represents a
        variable, with observations in the columns. Otherwise, the relationship
        is transposed: each column represents a variable, while the rows
        contain observations.
    bias : _NoValue, optional
        Has no effect, do not use.

        .. deprecated:: 1.10.0
    ddof : _NoValue, optional
        Has no effect, do not use.

        .. deprecated:: 1.10.0

    Returns
    -------
    R : ndarray
        The correlation coefficient matrix of the variables.

    See Also
    --------
    cov : Covariance matrix

    Notes
    -----
    Due to floating point rounding the resulting array may not be Hermitian,
    the diagonal elements may not be 1, and the elements may not satisfy the
    inequality abs(a) <= 1. The real and imaginary parts are clipped to the
    interval [-1,  1] in an attempt to improve on that situation but is not
    much help in the complex case.

    This function accepts but discards arguments `bias` and `ddof`.  This is
    for backwards compatibility with previous versions of this function.  These
    arguments had no effect on the return values of the function and can be
    safely ignored in this and previous versions of numpy.

A) Add a new column with title length.

In [39]:
df_sf_salaries['TitleLen'] = df_sf_salaries['JobTitle'].apply(len)

In [40]:
df_sf_salaries[['JobTitle', 'TitleLen', 'TotalPayBenefits']]

,JobTitle,TitleLen,TotalPayBenefits
0,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,46,567595.43
1,CAPTAIN III (POLICE DEPARTMENT),31,538909.28
2,CAPTAIN III (POLICE DEPARTMENT),31,335279.91
3,WIRE ROPE CABLE MAINTENANCE MECHANIC,36,332343.61
4,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",44,326373.19
...,...,...,...
148649,Custodian,9,0.00
148650,Not provided,12,0.00
148651,Not provided,12,0.00
148652,Not provided,12,0.00
148653,"Counselor, Log Cabin Ranch",26,-618.13

In [41]:
df_sf_salaries[['TitleLen', 'TotalPayBenefits']].corr()

                  TitleLen  TotalPayBenefits
TitleLen          1.000000         -0.036878
TotalPayBenefits -0.036878          1.000000

So they're not really correlated.

#### Answer

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

_____________________


# Scrap

In [6]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [7]:
# I'm trying to extract the sales done by Vanessa
df.loc[df['Person']=='Vanessa']

  Company   Person  Sales
3    MSFT  Vanessa    124

In [8]:
df.mean()

Sales    229.5
dtype: float64

* Pivot table stuff:

In [9]:
data_pivtb = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df_pivtb = pd.DataFrame(data_pivtb)
df_pivtb

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [11]:
df_pivtb.pivot_table(values='D',index='A', aggfunc= 'sum')

      D
A
bar  10
foo   6